packages/h1_parser.0.0.2/wrk_bench/h1_async.txt
Running 2m test @ http://127.0.0.1:8080/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 92.218ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.193ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.292ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.583ms, rate sampling interval: 291ms
  Thread calibration: mean lat.: 92.425ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.292ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.394ms, rate sampling interval: 290ms
  Thread calibration: mean lat.: 92.408ms, rate sampling interval: 291ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   108.57ms   48.54ms 626.18ms   84.06%
    Req/Sec     7.51k   380.18     8.70k    67.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  101.18ms
 75.000%  128.96ms
 90.000%  146.69ms
 99.000%  315.39ms
 99.900%  395.77ms
 99.990%  534.53ms
 99.999%  565.25ms
100.000%  626.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      19.023     0.000000            1         1.00
      60.671     0.100000       623597         1.11
      72.895     0.200000      1247538         1.25
      83.199     0.300000      1871018         1.43
      91.775     0.400000      2492715         1.67
     101.183     0.500000      3114858         2.00
     106.943     0.550000      3425573         2.22
     112.639     0.600000      3737450         2.50
     118.335     0.650000      4049200         2.86
     123.711     0.700000      4361735         3.33
     128.959     0.750000      4673644         4.00
     131.583     0.775000      4829368         4.44
     134.271     0.800000      4982992         5.00
     136.959     0.825000      5137727         5.71
     139.903     0.850000      5297980         6.67
     142.975     0.875000      5451274         8.00
     144.767     0.887500      5530065         8.89
     146.687     0.900000      5605202        10.00
     149.119     0.912500      5682707        11.43
     152.447     0.925000      5760024        13.33
     157.951     0.937500      5838549        16.00
     165.503     0.943750      5876901        17.78
     183.551     0.950000      5915882        20.00
     202.495     0.956250      5954855        22.86
     221.183     0.962500      5993536        26.67
     240.895     0.968750      6032658        32.00
     251.391     0.971875      6052097        35.56
     261.375     0.975000      6071441        40.00
     271.359     0.978125      6090882        45.71
     281.855     0.981250      6110685        53.33
     292.863     0.984375      6130088        64.00
     299.007     0.985938      6139494        71.11
     305.407     0.987500      6149264        80.00
     311.039     0.989062      6159052        91.43
     318.463     0.990625      6168912       106.67
     326.143     0.992188      6178711       128.00
     330.751     0.992969      6183296       142.22
     335.871     0.993750      6188216       160.00
     340.223     0.994531      6192993       182.86
     344.831     0.995313      6197873       213.33
     350.975     0.996094      6202857       256.00
     353.535     0.996484      6205330       284.44
     356.863     0.996875      6207640       320.00
     359.423     0.997266      6210126       365.71
     362.495     0.997656      6212527       426.67
     368.639     0.998047      6214925       512.00
     373.759     0.998242      6216139       568.89
     377.599     0.998437      6217358       640.00
     383.487     0.998633      6218537       731.43
     390.655     0.998828      6219768       853.33
     396.287     0.999023      6220987      1024.00
     399.103     0.999121      6221610      1137.78
     404.991     0.999219      6222180      1280.00
     416.255     0.999316      6222790      1462.86
     431.103     0.999414      6223408      1706.67
     438.527     0.999512      6224005      2048.00
     447.231     0.999561      6224313      2275.56
     454.399     0.999609      6224613      2560.00
     460.031     0.999658      6224915      2925.71
     469.759     0.999707      6225227      3413.33
     478.719     0.999756      6225524      4096.00
     487.423     0.999780      6225677      4551.11
     492.287     0.999805      6225844      5120.00
     496.383     0.999829      6225979      5851.43
     501.247     0.999854      6226133      6826.67
     516.863     0.999878      6226283      8192.00
     521.215     0.999890      6226363      9102.22
     537.599     0.999902      6226451     10240.00
     539.135     0.999915      6226523     11702.86
     541.183     0.999927      6226596     13653.33
     543.743     0.999939      6226686     16384.00
     544.767     0.999945      6226716     18204.44
     545.791     0.999951      6226741     20480.00
     548.351     0.999957      6226779     23405.71
     550.911     0.999963      6226815     27306.67
     552.447     0.999969      6226859     32768.00
     553.983     0.999973      6226872     36408.89
     555.007     0.999976      6226894     40960.00
     556.543     0.999979      6226909     46811.43
     559.615     0.999982      6226928     54613.33
     563.199     0.999985      6226947     65536.00
     563.711     0.999986      6226959     72817.78
     564.223     0.999988      6226971     81920.00
     565.247     0.999989      6226983     93622.86
     565.759     0.999991      6227001    109226.67
     565.759     0.999992      6227001    131072.00
     565.759     0.999993      6227001    145635.56
     566.271     0.999994      6227014    163840.00
     566.271     0.999995      6227014    187245.71
     566.271     0.999995      6227014    218453.33
     587.775     0.999996      6227026    262144.00
     587.775     0.999997      6227026    291271.11
     587.775     0.999997      6227026    327680.00
     587.775     0.999997      6227026    374491.43
     588.287     0.999998      6227031    436906.67
     588.287     0.999998      6227031    524288.00
     588.799     0.999998      6227033    582542.22
     588.799     0.999998      6227033    655360.00
     589.311     0.999999      6227036    748982.86
     589.311     0.999999      6227036    873813.33
     602.623     0.999999      6227037   1048576.00
     602.623     0.999999      6227037   1165084.44
     603.647     0.999999      6227039   1310720.00
     603.647     0.999999      6227039   1497965.71
     603.647     0.999999      6227039   1747626.67
     625.663     1.000000      6227040   2097152.00
     625.663     1.000000      6227040   2330168.89
     625.663     1.000000      6227040   2621440.00
     625.663     1.000000      6227040   2995931.43
     626.687     1.000000      6227042   3495253.33
     626.687     1.000000      6227042          inf
#[Mean    =      108.566, StdDeviation   =       48.542]
#[Max     =      626.176, Total count    =      6227042]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7006063 requests in 2.00m, 13.66GB read
Requests/sec:  58385.46
Transfer/sec:    116.60MB