packages/h1_parser.0.0.2/wrk_bench/h1_async_1ms_delay.txt
Running 2m test @ http://127.0.0.1:8080/delay
  8 threads and 10000 connections
  Thread calibration: mean lat.: 132.961ms, rate sampling interval: 355ms
  Thread calibration: mean lat.: 132.932ms, rate sampling interval: 359ms
  Thread calibration: mean lat.: 129.317ms, rate sampling interval: 332ms
  Thread calibration: mean lat.: 130.269ms, rate sampling interval: 332ms
  Thread calibration: mean lat.: 129.300ms, rate sampling interval: 334ms
  Thread calibration: mean lat.: 132.475ms, rate sampling interval: 342ms
  Thread calibration: mean lat.: 128.645ms, rate sampling interval: 328ms
  Thread calibration: mean lat.: 131.204ms, rate sampling interval: 337ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   144.75ms   58.77ms 743.42ms   88.61%
    Req/Sec     7.51k   332.17     8.88k    69.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  132.35ms
 75.000%  150.01ms
 90.000%  195.07ms
 99.000%  375.55ms
 99.900%  513.79ms
 99.990%  584.19ms
 99.999%  663.04ms
100.000%  743.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      56.575     0.000000            1         1.00
     100.031     0.100000       623999         1.11
     109.439     0.200000      1246315         1.25
     117.503     0.300000      1871189         1.43
     124.863     0.400000      2493953         1.67
     132.351     0.500000      3116026         2.00
     135.679     0.550000      3422515         2.22
     139.135     0.600000      3734449         2.50
     142.847     0.650000      4047420         2.86
     146.303     0.700000      4356979         3.33
     150.015     0.750000      4673913         4.00
     151.935     0.775000      4825531         4.44
     153.983     0.800000      4982176         5.00
     156.287     0.825000      5140074         5.71
     159.103     0.850000      5292864         6.67
     163.839     0.875000      5445882         8.00
     172.415     0.887500      5522914         8.89
     195.071     0.900000      5600590        10.00
     219.391     0.912500      5678375        11.43
     243.583     0.925000      5755975        13.33
     268.287     0.937500      5834031        16.00
     280.575     0.943750      5873245        17.78
     291.839     0.950000      5911638        20.00
     303.871     0.956250      5951186        22.86
     314.623     0.962500      5989988        26.67
     325.631     0.968750      6028436        32.00
     331.519     0.971875      6047672        35.56
     337.663     0.975000      6067915        40.00
     343.551     0.978125      6087156        45.71
     349.695     0.981250      6106281        53.33
     356.863     0.984375      6125669        64.00
     361.727     0.985938      6135461        71.11
     367.103     0.987500      6145250        80.00
     372.223     0.989062      6154842        91.43
     378.367     0.990625      6164632       106.67
     386.559     0.992188      6174061       128.00
     391.679     0.992969      6179031       142.22
     397.823     0.993750      6183858       160.00
     407.551     0.994531      6188674       182.86
     421.631     0.995313      6193508       213.33
     436.479     0.996094      6198377       256.00
     444.671     0.996484      6200840       284.44
     454.143     0.996875      6203311       320.00
     464.639     0.997266      6205666       365.71
     473.343     0.997656      6208080       426.67
     482.047     0.998047      6210601       512.00
     486.143     0.998242      6211772       568.89
     493.567     0.998437      6213001       640.00
     498.943     0.998633      6214220       731.43
     505.599     0.998828      6215406       853.33
     515.071     0.999023      6216594      1024.00
     520.447     0.999121      6217224      1137.78
     524.287     0.999219      6217825      1280.00
     528.895     0.999316      6218451      1462.86
     533.503     0.999414      6219033      1706.67
     543.231     0.999512      6219682      2048.00
     546.303     0.999561      6219936      2275.56
     550.399     0.999609      6220242      2560.00
     553.983     0.999658      6220551      2925.71
     559.103     0.999707      6220858      3413.33
     565.759     0.999756      6221195      4096.00
     567.295     0.999780      6221338      4551.11
     570.879     0.999805      6221454      5120.00
     574.975     0.999829      6221605      5851.43
     579.071     0.999854      6221762      6826.67
     580.607     0.999878      6221905      8192.00
     583.167     0.999890      6222004      9102.22
     584.191     0.999902      6222066     10240.00
     586.239     0.999915      6222140     11702.86
     589.823     0.999927      6222208     13653.33
     597.503     0.999939      6222284     16384.00
     601.087     0.999945      6222326     18204.44
     602.111     0.999951      6222360     20480.00
     613.375     0.999957      6222397     23405.71
     615.423     0.999963      6222437     27306.67
     622.591     0.999969      6222475     32768.00
     630.783     0.999973      6222495     36408.89
     632.831     0.999976      6222516     40960.00
     633.343     0.999979      6222535     46811.43
     633.855     0.999982      6222550     54613.33
     635.903     0.999985      6222569     65536.00
     640.511     0.999986      6222580     72817.78
     655.871     0.999988      6222589     81920.00
     662.527     0.999989      6222599     93622.86
     678.911     0.999991      6222610    109226.67
     684.031     0.999992      6222615    131072.00
     685.567     0.999993      6222621    145635.56
     690.175     0.999994      6222627    163840.00
     690.687     0.999995      6222631    187245.71
     691.199     0.999995      6222634    218453.33
     698.367     0.999996      6222639    262144.00
     707.071     0.999997      6222641    291271.11
     715.775     0.999997      6222649    327680.00
     715.775     0.999997      6222649    374491.43
     715.775     0.999998      6222649    436906.67
     716.287     0.999998      6222654    524288.00
     716.287     0.999998      6222654    582542.22
     716.287     0.999998      6222654    655360.00
     716.287     0.999999      6222654    748982.86
     718.847     0.999999      6222655    873813.33
     723.967     0.999999      6222658   1048576.00
     723.967     0.999999      6222658   1165084.44
     723.967     0.999999      6222658   1310720.00
     723.967     0.999999      6222658   1497965.71
     724.479     0.999999      6222661   1747626.67
     724.479     1.000000      6222661   2097152.00
     724.479     1.000000      6222661   2330168.89
     724.479     1.000000      6222661   2621440.00
     724.479     1.000000      6222661   2995931.43
     724.479     1.000000      6222661   3495253.33
     724.479     1.000000      6222661   4194304.00
     724.479     1.000000      6222661   4660337.78
     724.479     1.000000      6222661   5242880.00
     724.479     1.000000      6222661   5991862.86
     743.935     1.000000      6222662   6990506.67
     743.935     1.000000      6222662          inf
#[Mean    =      144.754, StdDeviation   =       58.773]
#[Max     =      743.424, Total count    =      6222662]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7002456 requests in 2.00m, 13.66GB read
Requests/sec:  58354.21
Transfer/sec:    116.53MB